docs/benchmarks/20260502_012739_compare_c500/run_b_raw.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /script.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m30s max duration (incl. graceful stop):
              * booking_stress: 500 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 500/500 VUs, 42593 complete and 0 interrupted iterations
booking_stress   [   2% ] 500 VUs  0m01.0s/1m0s

running (0m02.0s), 500/500 VUs, 88295 complete and 0 interrupted iterations
booking_stress   [   3% ] 500 VUs  0m02.0s/1m0s

running (0m03.0s), 500/500 VUs, 136937 complete and 0 interrupted iterations
booking_stress   [   5% ] 500 VUs  0m03.0s/1m0s

running (0m04.0s), 500/500 VUs, 185705 complete and 0 interrupted iterations
booking_stress   [   7% ] 500 VUs  0m04.0s/1m0s

running (0m05.0s), 500/500 VUs, 233811 complete and 0 interrupted iterations
booking_stress   [   8% ] 500 VUs  0m05.0s/1m0s

running (0m06.0s), 500/500 VUs, 282502 complete and 0 interrupted iterations
booking_stress   [  10% ] 500 VUs  0m06.0s/1m0s

running (0m07.0s), 500/500 VUs, 326258 complete and 0 interrupted iterations
booking_stress   [  12% ] 500 VUs  0m07.0s/1m0s

running (0m08.0s), 500/500 VUs, 372821 complete and 0 interrupted iterations
booking_stress   [  13% ] 500 VUs  0m08.0s/1m0s

running (0m09.0s), 500/500 VUs, 418806 complete and 0 interrupted iterations
booking_stress   [  15% ] 500 VUs  0m09.0s/1m0s

running (0m10.0s), 500/500 VUs, 465642 complete and 0 interrupted iterations
booking_stress   [  17% ] 500 VUs  0m10.0s/1m0s

running (0m11.0s), 500/500 VUs, 511183 complete and 0 interrupted iterations
booking_stress   [  18% ] 500 VUs  0m11.0s/1m0s

running (0m12.0s), 500/500 VUs, 555605 complete and 0 interrupted iterations
booking_stress   [  20% ] 500 VUs  0m12.0s/1m0s

running (0m13.0s), 500/500 VUs, 601449 complete and 0 interrupted iterations
booking_stress   [  22% ] 500 VUs  0m13.0s/1m0s

running (0m14.0s), 500/500 VUs, 645265 complete and 0 interrupted iterations
booking_stress   [  23% ] 500 VUs  0m14.0s/1m0s

running (0m15.0s), 500/500 VUs, 688595 complete and 0 interrupted iterations
booking_stress   [  25% ] 500 VUs  0m15.0s/1m0s

running (0m16.0s), 500/500 VUs, 732077 complete and 0 interrupted iterations
booking_stress   [  27% ] 500 VUs  0m16.0s/1m0s

running (0m17.0s), 500/500 VUs, 776057 complete and 0 interrupted iterations
booking_stress   [  28% ] 500 VUs  0m17.0s/1m0s

running (0m18.0s), 500/500 VUs, 820597 complete and 0 interrupted iterations
booking_stress   [  30% ] 500 VUs  0m18.0s/1m0s

running (0m19.0s), 500/500 VUs, 863418 complete and 0 interrupted iterations
booking_stress   [  32% ] 500 VUs  0m19.0s/1m0s

running (0m20.0s), 500/500 VUs, 908832 complete and 0 interrupted iterations
booking_stress   [  33% ] 500 VUs  0m20.0s/1m0s

running (0m21.0s), 500/500 VUs, 955601 complete and 0 interrupted iterations
booking_stress   [  35% ] 500 VUs  0m21.0s/1m0s

running (0m22.0s), 500/500 VUs, 1002177 complete and 0 interrupted iterations
booking_stress   [  37% ] 500 VUs  0m22.0s/1m0s

running (0m23.0s), 500/500 VUs, 1041039 complete and 0 interrupted iterations
booking_stress   [  38% ] 500 VUs  0m23.0s/1m0s

running (0m24.0s), 500/500 VUs, 1086726 complete and 0 interrupted iterations
booking_stress   [  40% ] 500 VUs  0m24.0s/1m0s

running (0m25.0s), 500/500 VUs, 1131253 complete and 0 interrupted iterations
booking_stress   [  42% ] 500 VUs  0m25.0s/1m0s

running (0m26.0s), 500/500 VUs, 1174118 complete and 0 interrupted iterations
booking_stress   [  43% ] 500 VUs  0m26.0s/1m0s

running (0m27.0s), 500/500 VUs, 1219603 complete and 0 interrupted iterations
booking_stress   [  45% ] 500 VUs  0m27.0s/1m0s

running (0m28.0s), 500/500 VUs, 1263598 complete and 0 interrupted iterations
booking_stress   [  47% ] 500 VUs  0m28.0s/1m0s

running (0m29.0s), 500/500 VUs, 1308826 complete and 0 interrupted iterations
booking_stress   [  48% ] 500 VUs  0m29.0s/1m0s

running (0m30.0s), 500/500 VUs, 1355292 complete and 0 interrupted iterations
booking_stress   [  50% ] 500 VUs  0m30.0s/1m0s

running (0m31.0s), 500/500 VUs, 1398853 complete and 0 interrupted iterations
booking_stress   [  52% ] 500 VUs  0m31.0s/1m0s

running (0m32.0s), 500/500 VUs, 1445495 complete and 0 interrupted iterations
booking_stress   [  53% ] 500 VUs  0m32.0s/1m0s

running (0m33.0s), 500/500 VUs, 1491742 complete and 0 interrupted iterations
booking_stress   [  55% ] 500 VUs  0m33.0s/1m0s

running (0m34.0s), 500/500 VUs, 1538804 complete and 0 interrupted iterations
booking_stress   [  57% ] 500 VUs  0m34.0s/1m0s

running (0m35.0s), 500/500 VUs, 1586487 complete and 0 interrupted iterations
booking_stress   [  58% ] 500 VUs  0m35.0s/1m0s

running (0m36.0s), 500/500 VUs, 1633099 complete and 0 interrupted iterations
booking_stress   [  60% ] 500 VUs  0m36.0s/1m0s

running (0m37.0s), 500/500 VUs, 1678296 complete and 0 interrupted iterations
booking_stress   [  62% ] 500 VUs  0m37.0s/1m0s

running (0m38.0s), 500/500 VUs, 1726395 complete and 0 interrupted iterations
booking_stress   [  63% ] 500 VUs  0m38.0s/1m0s

running (0m39.0s), 500/500 VUs, 1767916 complete and 0 interrupted iterations
booking_stress   [  65% ] 500 VUs  0m39.0s/1m0s

running (0m40.0s), 500/500 VUs, 1813472 complete and 0 interrupted iterations
booking_stress   [  67% ] 500 VUs  0m40.0s/1m0s

running (0m41.0s), 500/500 VUs, 1858621 complete and 0 interrupted iterations
booking_stress   [  68% ] 500 VUs  0m41.0s/1m0s

running (0m42.0s), 500/500 VUs, 1904804 complete and 0 interrupted iterations
booking_stress   [  70% ] 500 VUs  0m42.0s/1m0s

running (0m43.0s), 500/500 VUs, 1951279 complete and 0 interrupted iterations
booking_stress   [  72% ] 500 VUs  0m43.0s/1m0s

running (0m44.0s), 500/500 VUs, 1994735 complete and 0 interrupted iterations
booking_stress   [  73% ] 500 VUs  0m44.0s/1m0s

running (0m45.0s), 500/500 VUs, 2040569 complete and 0 interrupted iterations
booking_stress   [  75% ] 500 VUs  0m45.0s/1m0s

running (0m46.0s), 500/500 VUs, 2087299 complete and 0 interrupted iterations
booking_stress   [  77% ] 500 VUs  0m46.0s/1m0s

running (0m47.0s), 500/500 VUs, 2134576 complete and 0 interrupted iterations
booking_stress   [  78% ] 500 VUs  0m47.0s/1m0s

running (0m48.0s), 500/500 VUs, 2183837 complete and 0 interrupted iterations
booking_stress   [  80% ] 500 VUs  0m48.0s/1m0s

running (0m49.0s), 500/500 VUs, 2232023 complete and 0 interrupted iterations
booking_stress   [  82% ] 500 VUs  0m49.0s/1m0s

running (0m50.0s), 500/500 VUs, 2278968 complete and 0 interrupted iterations
booking_stress   [  83% ] 500 VUs  0m50.0s/1m0s

running (0m51.0s), 500/500 VUs, 2324847 complete and 0 interrupted iterations
booking_stress   [  85% ] 500 VUs  0m51.0s/1m0s

running (0m52.0s), 500/500 VUs, 2373467 complete and 0 interrupted iterations
booking_stress   [  87% ] 500 VUs  0m52.0s/1m0s

running (0m53.0s), 500/500 VUs, 2421808 complete and 0 interrupted iterations
booking_stress   [  88% ] 500 VUs  0m53.0s/1m0s

running (0m54.0s), 500/500 VUs, 2465379 complete and 0 interrupted iterations
booking_stress   [  90% ] 500 VUs  0m54.0s/1m0s

running (0m55.0s), 500/500 VUs, 2506612 complete and 0 interrupted iterations
booking_stress   [  92% ] 500 VUs  0m55.0s/1m0s

running (0m56.0s), 500/500 VUs, 2552723 complete and 0 interrupted iterations
booking_stress   [  93% ] 500 VUs  0m56.0s/1m0s

running (0m57.0s), 500/500 VUs, 2598009 complete and 0 interrupted iterations
booking_stress   [  95% ] 500 VUs  0m57.0s/1m0s

running (0m58.0s), 500/500 VUs, 2646272 complete and 0 interrupted iterations
booking_stress   [  97% ] 500 VUs  0m58.0s/1m0s

running (0m59.0s), 500/500 VUs, 2694091 complete and 0 interrupted iterations
booking_stress   [  98% ] 500 VUs  0m59.0s/1m0s

running (1m00.0s), 500/500 VUs, 2743681 complete and 0 interrupted iterations
booking_stress   [ 100% ] 500 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    business_errors
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=14.01ms


  █ TOTAL RESULTS 

    checks_total.......: 5490851 91498.100127/s
    checks_succeeded...: 59.10%  3245435 out of 5490851
    checks_failed......: 40.89%  2245416 out of 5490851

    ✓ setup event created
    ✓ status is 202 or 409
    ✗ booking accepted
      ↳  18% — ✓ 500009 / ✗ 2245416

    CUSTOM
    accepted_bookings..............: 500009  8332.018761/s
    booking_duration...............: avg=7.63ms  min=0s      med=6ms    max=77ms    p(90)=14ms    p(95)=18ms   
    business_errors................: 0.00%   0 out of 2745425

    HTTP
    http_req_duration..............: avg=5.27ms  min=52.04µs med=3.98ms max=77.08ms p(90)=10.63ms p(95)=14.01ms
      { expected_response:true }...: avg=4.14ms  min=52.04µs med=3.08ms max=48.52ms p(90)=8.34ms  p(95)=11.23ms
    http_req_failed................: 81.78%  2245416 out of 2745426
    http_reqs......................: 2745426 45749.058395/s

    EXECUTION
    iteration_duration.............: avg=10.67ms min=82.62µs med=9.01ms max=98.49ms p(90)=20.35ms p(95)=24.84ms
    iterations.....................: 2745425 45749.041731/s
    vus............................: 500     min=500                max=500
    vus_max........................: 500     min=500                max=500

    NETWORK
    data_received..................: 610 MB  10 MB/s
    data_sent......................: 576 MB  9.6 MB/s



running (1m00.0s), 000/500 VUs, 2745425 complete and 0 interrupted iterations
booking_stress ✓ [ 100% ] 500 VUs  1m0s